In [7]:
# import libraries
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [8]:
def create_server_connection(host_name, user_name, user_pwd):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_pwd
        )
        print("MySQL Database connection is successful")
    except Error as err:
        print(f"Error: '{err}' ")
    return connection
# Put our MySQL Terminal Password
pw = "XXXXXXXXXXXXXX"
# Database Name
db = "mysql_python"
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection is successful

In [10]:
# Create mysql_python
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error : '{err}'")
create_database_query = "Create database mysql_python"
create_database(connection, create_database_query)

Database created successfully

In [15]:
# Connect to database
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name)
        print("MySQL database connection successful")
    except Error as err:
        print(f"Error : '{err}'")
    return connection

In [16]:
# Execute SQL queries
def execute_query(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error : '{err}'")
    return connection

In [20]:
# Create a table in MySQL
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""
# Connect to the database
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successful
Query was successful

In [22]:
# Insert data
data_orders = """
insert into orders values 
(101,'Sai Praveen1', 'Laptop', '2024-12-24', 2, 800, '9884001635'),
(102,'Prithwin Arya1', 'Kindle', '2024-12-24', 2, 12800, '9884001636'),
(103,'Sai Praveen2', 'Phone', '2024-12-24', 3, 14800, '9884001637'),
(104,'Prithwin Arya2', 'T-Shirt', '2024-12-24', 4, 500, '9884001638'),
(105,'Sai Praveen3', 'Pants', '2024-12-24', 5, 400, '9884001639'),
(106,'Prithwin Arya3', 'Smart-TV', '2024-12-24', 1, 20000, '9884001639');
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, data_orders)

MySQL database connection successful
Error : '1062 (23000): Duplicate entry '101' for key 'orders.PRIMARY''

In [23]:
def read_query(connection,query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error : '{err}'")

In [24]:
# Using the select stmt
q1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection,q1)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Sai Praveen1', 'Laptop', datetime.date(2024, 12, 24), 2, 800.0, '9884001635')
(102, 'Prithwin Arya1', 'Kindle', datetime.date(2024, 12, 24), 2, 12800.0, '9884001636')
(103, 'Sai Praveen2', 'Phone', datetime.date(2024, 12, 24), 3, 14800.0, '9884001637')
(104, 'Prithwin Arya2', 'T-Shirt', datetime.date(2024, 12, 24), 4, 500.0, '9884001638')
(105, 'Sai Praveen3', 'Pants', datetime.date(2024, 12, 24), 5, 400.0, '9884001639')
(106, 'Prithwin Arya3', 'Smart-TV', datetime.date(2024, 12, 24), 1, 20000.0, '9884001639')

In [28]:
# Using the select stmt
q2 = """
select customer_name from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection,q2)
for result in results:
    print(result)

MySQL database connection successful
('Sai Praveen1',)
('Prithwin Arya1',)
('Sai Praveen2',)
('Prithwin Arya2',)
('Sai Praveen3',)
('Prithwin Arya3',)

In [29]:
# Using the select stmt - Year display
q3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection,q3)
for result in results:
    print(result)

MySQL database connection successful
(2024,)
(2024,)
(2024,)
(2024,)
(2024,)
(2024,)

In [30]:
# Using the select stmt - Year display
q4 = """
select product_name from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection,q4)
for result in results:
    print(result)

MySQL database connection successful
('Laptop',)
('Kindle',)
('Phone',)
('T-Shirt',)
('Pants',)
('Smart-TV',)

In [31]:
# Using the select stmt - Year display
q5 = """
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection,q5)
for result in results:
    print(result)

MySQL database connection successful
(2024,)

In [32]:
# Using the select stmt - quantity < 5
q6 = """
select * from orders where quantity < 5;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection,q6)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Sai Praveen1', 'Laptop', datetime.date(2024, 12, 24), 2, 800.0, '9884001635')
(102, 'Prithwin Arya1', 'Kindle', datetime.date(2024, 12, 24), 2, 12800.0, '9884001636')
(103, 'Sai Praveen2', 'Phone', datetime.date(2024, 12, 24), 3, 14800.0, '9884001637')
(104, 'Prithwin Arya2', 'T-Shirt', datetime.date(2024, 12, 24), 4, 500.0, '9884001638')
(106, 'Prithwin Arya3', 'Smart-TV', datetime.date(2024, 12, 24), 1, 20000.0, '9884001639')

In [33]:
# Using the select stmt - unit price 
q7 = """
select * from orders order by unit_price;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection,q7)
for result in results:
    print(result)

MySQL database connection successful
(105, 'Sai Praveen3', 'Pants', datetime.date(2024, 12, 24), 5, 400.0, '9884001639')
(104, 'Prithwin Arya2', 'T-Shirt', datetime.date(2024, 12, 24), 4, 500.0, '9884001638')
(101, 'Sai Praveen1', 'Laptop', datetime.date(2024, 12, 24), 2, 800.0, '9884001635')
(102, 'Prithwin Arya1', 'Kindle', datetime.date(2024, 12, 24), 2, 12800.0, '9884001636')
(103, 'Sai Praveen2', 'Phone', datetime.date(2024, 12, 24), 3, 14800.0, '9884001637')
(106, 'Prithwin Arya3', 'Smart-TV', datetime.date(2024, 12, 24), 1, 20000.0, '9884001639')

In [38]:
# Create a data frame from the table
from_db = []
for result in results:
    result = list(result)  #RHS result is a row from the table
    from_db.append(result)
columns = ["order_id", "customer_name", "product_name", "date_ordered", "quantity", "unit_price", "phone_number"]
df = pd.DataFrame(from_db, columns=columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,105,Sai Praveen3,Pants,2024-12-24,5,400.0,9884001639
1,104,Prithwin Arya2,T-Shirt,2024-12-24,4,500.0,9884001638
2,101,Sai Praveen1,Laptop,2024-12-24,2,800.0,9884001635
3,102,Prithwin Arya1,Kindle,2024-12-24,2,12800.0,9884001636
4,103,Sai Praveen2,Phone,2024-12-24,3,14800.0,9884001637
5,106,Prithwin Arya3,Smart-TV,2024-12-24,1,20000.0,9884001639

In [39]:
# Update command
update = """
update orders 
set unit_price = 45
where order_id = 103
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection,update)

MySQL database connection successful
Query was successful

In [40]:
# Using the select stmt
q1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection,q1)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Sai Praveen1', 'Laptop', datetime.date(2024, 12, 24), 2, 800.0, '9884001635')
(102, 'Prithwin Arya1', 'Kindle', datetime.date(2024, 12, 24), 2, 12800.0, '9884001636')
(103, 'Sai Praveen2', 'Phone', datetime.date(2024, 12, 24), 3, 45.0, '9884001637')
(104, 'Prithwin Arya2', 'T-Shirt', datetime.date(2024, 12, 24), 4, 500.0, '9884001638')
(105, 'Sai Praveen3', 'Pants', datetime.date(2024, 12, 24), 5, 400.0, '9884001639')
(106, 'Prithwin Arya3', 'Smart-TV', datetime.date(2024, 12, 24), 1, 20000.0, '9884001639')